
{
    "Pesachim 102b":null,
    "https://shas.alhatorah.org/Full/Pesachim/102b.1#e0n6":null,
    "פסחים":null,
    "ק״ב":null,
    "ב":null,
    "גמרא": {

        "gemora full amud in one contiguous string":null,
        "גמרו כוס ראשון מברך עליו ברכת המזון והשני אומר עליו קדושת היום אמאי ונימרינהו לתרוייהו אחדא כסא אמר רב הונא אמר רב ששת אין אומרים שתי קדושות על כוס אחד מאי טעמא אמר רב נחמן בר יצחק לפי שאין עושין מצות חבילות חבילות ולא והא תניא הנכנס לביתו במוצאי שבת מברך על היין ועל המאור ועל הבשמים ואחר כך אומר הבדלה על הכוס ואם אין לו אלא כוס אחד מניחו לאחר המזון ומשלשלן כולן לאחריו אין לו שאני והא יו״ט שחל להיות אחר השבת דאית ליה ואמר רב יקנ״ה אמרי מדלא אמר זמן מכלל דבשביעי של פסח עסקינן דכל מאי דהוה ליה אכיל ליה ולית לי׳ והא יו״ט ראשון דאית ליה ואמר אביי יקזנ״ה ורבא אמר יקנה״ז אלא הבדלה וקידוש חדא מילתא היא ברכת המזון וקידוש תרי מילי נינהו: גופא יום טוב שחל להיות אחר השבת רב אמר יקנ״ה ושמואל אמר ינה״ק":null
    },

    "רש״י": {

        "one complete rashi at a time":null,
        "גמרו – סעודתן.":null,
        "אומר עליו כו׳ – ר׳ יוסי קאמר לה.":null,
        "משלשלן – עד לאחר המזון אלמא אמרי׳ שתי ברכות על כוס אחד הבדלה וברהמ״ז.":null,
        "ואמר רב יקנ״ה – כדמפרש בשביעי עסקינן ובשביעי ליכא זמן ומכל מקום שמעינן מינה קידוש והבדלה על כוס אחד.":null,
        "ומשנינן מדלא קאמר זמן – בשביעי של פסח עסקי׳ דשמא עני הוא ואין לו אלא כוס א׳.":null,
        "והא יום ראשון דאית ליה – דאפי׳ עני שבישראל לא יפחתו לו מארבע כוסות.":null,
        "קידוש והבדלה חדא מלתא היא – דתרוייהו משום קדושת יו״ט נינהו ובהבדלה עצמו הוא מזכיר קדוש׳ יו״ט דהמבדיל בין קדש לקדש קא מברך.":null,

        "dibur hamaskil and rashi key-value pairs":null,
        "גמרו":"סעודתן",
        "אומר עליו כו׳":"ר׳ יוסי קאמר לה",
        "משלשלן":"עד לאחר המזון אלמא אמרי׳ שתי ברכות על כוס אחד הבדלה וברהמ״ז",
        "אמר רב יקנ״ה":"כדמפרש בשביעי עסקינן ובשביעי ליכא זמן ומכל מקום שמעינן מינה קידוש והבדלה על כוס אחד",
        "ומשנינן מדלא קאמר זמן":"בשביעי של פסח עסקי׳ דשמא עני הוא ואין לו אלא כוס א׳",
        "והא יום ראשון דאית ליה":"דאפי׳ עני שבישראל לא יפחתו לו מארבע כוסות",
        "קידוש והבדלה חדא מלתא היא":"דתרוייהו משום קדושת יו״ט נינהו ובהבדלה עצמו הוא מזכיר קדוש׳ יו״ט דהמבדיל בין קדש לקדש קא מברך",

        "rashi full amud in one contiguous string":null,
        "גמרו – סעודתן. אומר עליו כו׳ – ר׳ יוסי קאמר לה. משלשלן – עד לאחר המזון אלמא אמרי׳ שתי ברכות על כוס אחד הבדלה וברהמ״ז. ואמר רב יקנ״ה – כדמפרש בשביעי עסקינן ובשביעי ליכא זמן ומכל מקום שמעינן מינה קידוש והבדלה על כוס אחד. ומשנינן מדלא קאמר זמן – בשביעי של פסח עסקי׳ דשמא עני הוא ואין לו אלא כוס א׳. והא יום ראשון דאית ליה – דאפי׳ עני שבישראל לא יפחתו לו מארבע כוסות. קידוש והבדלה חדא מלתא היא – דתרוייהו משום קדושת יו״ט נינהו ובהבדלה עצמו הוא מזכיר קדוש׳ יו״ט דהמבדיל בין קדש לקדש קא מברך.":null

    },

    "רשב״ם": {

        "one complete rashbam at a time":null,
        
        "גמרו   .   סעודתן":null,
        "כוס ראשון אומר עליו ברכת המזון כו׳   .   ר׳ יוסי קאמר לה ורבותא הוא שאינו צריך לקדש מיד אלא יגמור סעודתו ויברך ברכת המזון ואח״כ יקדש ומיהו אם פרס מפה וקידש מודה רבי יוסי דכל שכן דשפיר טפי דאי לא תימא הכי אלא דוקא קאמר רבי יוסי ראשון מברך עליו ברהמ״ז אם כן שמואל דאמר כמאן (לעיל דף ק.): ולימרינהו תרוייהו אחד כסא קידוש היום וברכת המזון ולרבי יוסי קא פריך דאילו לרבי יהודה כיון דמפסיקין וצריך עקירת שלחן צריך שני כוסות.":null,
        "שני קדושות   .   ברכת המזון קורא קדושה כקידוש היום כלומר שתי מצות":null,
        "חבילות חבילות   .   דמיחזי עליה כמשוי":null,
        "מברך על היין   .   תחלה לפי שהוא תדיר ותדיר קודם.":null,
        "על המאור ועל הבשמים   .   כב״ש מוקמינן לה במסכת ברכות בפרק אלו דברים (ד׳ נב.) דאמר מאור ברישא ואחר כך בשמים והבדלה לבסוף לפי שאלו הראשונות קצרות וברכת הבדלה ארוכה לפיכך אומרה לבסוף.":null,
        "משלשלן   .   לשון שלשלת שמחברם יחד עם ברכת המזון אלמא אמרינן שתי ברכות על כוס אחד הבדלה וברכת המזון.":null,
        "אין לו שאני   .   דלית ליה יין לשני כוסות ואנן בדאית ליה עסקינן.":null,
        "אחר השבת   .   מוצאי השבת.":null,
        "דאית ליה וקאמר רב יקנ״ה   .   קס״ד בי״ט הראשון של פסח שחל להיות אחר השבת עסקינן דאית ליה כוסות הרבה דתנן לעיל (ד׳ צט:) אפילו עני שבישראל לא יפחתו לו מארבע כוסות ואמר רב יקנ״ה אלמא קידוש והבדלה על כוס אחד מצי אמר.":null,
        "ומשני":null,
        "מדלא אמר רב יקנה״ז אלמא בשביעי של פסח עסקינן   .   דשמא עני הוא ואין לו אלא כוס אחד וטעמיה דרב לקמיה אפרשנו במקומו וכן דרבא ודאביי.":null,
        "והא יו״ט ראשון דאית ליה   .   דאפי׳ עני שבישראל לא יפחתו לו מארבע כוסות.":null,
        "קידושא והבדלה חדא מילתא היא   .   תרוייהו משום קדושת ימים טובים נינהו ובהבדלה עצמה הוא מזכיר קדושת יו״ט דהמבדיל בין קדש לקדש מברך.":null,
        "גופא יו״ט שחל להיות אחר השבת   .   צריך להבדיל ולקדש ומשמע שאם לא היה יום טוב לא היו חולקין האמוראין הללו אלא כולי עלמא מודו יין מאור והבדלה והשתא דאיכא קדושת היום פליגי ולפיכך צריך ליתן טעם לכל דבריהם ולומר שהקידוש גורם לשנות את הסדר מכמות שרגיל.":null,
        "רב אמר יקנ״ה   .   ס״ל קדושת היום עדיפא מהבדלה אי נמי דכי מבדיל ברישא מיחזי דהוי עליה קדושת היום כמשוי ולפיכך יין קודם לקידוש כבית הלל (ברכות דף נא:) דתדיר ושאינו תדיר תדיר קודם ואחר הקידוש נר והבדלה כשאר מוצאי שבתות שהנר קודם להבדלה.":null,
        "ושמואל אמר ינה״ק   .    – שמואל סבירא ליה הבדלה קודם לקידוש כדמפרש טעמא לקמיה משל דרבי יהושע בן חנניא למה הדבר דומה למלך שיצא ואפרכוס נכנס מלוין את המלך השבת להבדיל ואח״כ יוצאין לקראת אפרכוס לקראת יו״ט לקדשו ועל מלתיה דשמואל אמר לה בהדיא בברכות בירושלמי באלו דברים רבי חנינא אמר ינה״ק ואתי רבי חנינא כשמואל דא״ר חנינא בשם שמואל משל למלך יוצא ושלטון נכנס מלוין את המלך ואח״כ מכניסין את השלטון הלכך יין תחלה ואח״כ מאור ואח״כ הבדלה דכיון דהבדלה קודם לקידוש יעשה כל סדר הבדלה כדין מוצאי שבתות דעלמא ואח״כ יקדש ומה שאין נותנין האמוראין סימן לבשמים לפי שאין מברכין על הבשמים ביו״ט שהרי גם ביו״ט יש לנו נשמה יתירה כשבת.":null,
        

        "dibur hamaskil and rashbam key-value pairs":null,
        "גמרו":"סעודתן",
        "כוס ראשון אומר עליו ברכת המזון כו׳": "ר׳ יוסי קאמר לה ורבותא הוא שאינו צריך לקדש מיד אלא יגמור סעודתו ויברך ברכת המזון ואח״כ יקדש ומיהו אם פרס מפה וקידש מודה רבי יוסי דכל שכן דשפיר טפי דאי לא תימא הכי אלא דוקא קאמר רבי יוסי ראשון מברך עליו ברהמ״ז אם כן שמואל דאמר כמאן (לעיל דף ק.): ולימרינהו תרוייהו אחד כסא קידוש היום וברכת המזון ולרבי יוסי קא פריך דאילו לרבי יהודה כיון דמפסיקין וצריך עקירת שלחן צריך שני כוסות.",
        "שני קדושות":"ברכת המזון קורא קדושה כקידוש היום כלומר שתי מצות.",
        "חבילות חבילות":"דמיחזי עליה כמשוי.",
        "מברך על היין":"תחלה לפי שהוא תדיר ותדיר קודם.",
        "על המאור ועל הבשמים":"כב״ש מוקמינן לה במסכת ברכות בפרק אלו דברים (ד׳ נב.) דאמר מאור ברישא ואחר כך בשמים והבדלה לבסוף לפי שאלו הראשונות קצרות וברכת הבדלה ארוכה לפיכך אומרה לבסוף.",
        "משלשלן":"לשון שלשלת שמחברם יחד עם ברכת המזון אלמא אמרינן שתי ברכות על כוס אחד הבדלה וברכת המזון.",
        "אין לו שאני":"דלית ליה יין לשני כוסות ואנן בדאית ליה עסקינן.",
        "אחר השבת":"מוצאי השבת.",
        "דאית ליה וקאמר רב יקנ״ה":"קס״ד בי״ט הראשון של פסח שחל להיות אחר השבת עסקינן דאית ליה כוסות הרבה דתנן לעיל (ד׳ צט:) אפילו עני שבישראל לא יפחתו לו מארבע כוסות ואמר רב יקנ״ה אלמא קידוש והבדלה על כוס אחד מצי אמר.",
        "ומשני": null,
        "מדלא אמר רב יקנה״ז אלמא בשביעי של פסח עסקינן":"דשמא עני הוא ואין לו אלא כוס אחד וטעמיה דרב לקמיה אפרשנו במקומו וכן דרבא ודאביי.",
        "והא יו״ט ראשון דאית ליה":"דאפי׳ עני שבישראל לא יפחתו לו מארבע כוסות.",
        "קידושא והבדלה חדא מילתא היא":"תרוייהו משום קדושת ימים טובים נינהו ובהבדלה עצמה הוא מזכיר קדושת יו״ט דהמבדיל בין קדש לקדש מברך.",
        "גופא יו״ט שחל להיות אחר השבת":"צריך להבדיל ולקדש ומשמע שאם לא היה יום טוב לא היו חולקין האמוראין הללו אלא כולי עלמא מודו יין מאור והבדלה והשתא דאיכא קדושת היום פליגי ולפיכך צריך ליתן טעם לכל דבריהם ולומר שהקידוש גורם לשנות את הסדר מכמות שרגיל.",
        "רב אמר יקנ״ה":"ס״ל קדושת היום עדיפא מהבדלה אי נמי דכי מבדיל ברישא מיחזי דהוי עליה קדושת היום כמשוי ולפיכך יין קודם לקידוש כבית הלל (ברכות דף נא:) דתדיר ושאינו תדיר תדיר קודם ואחר הקידוש נר והבדלה כשאר מוצאי שבתות שהנר קודם להבדלה.",
        "ושמואל אמר ינה״ק":" – שמואל סבירא ליה הבדלה קודם לקידוש כדמפרש טעמא לקמיה משל דרבי יהושע בן חנניא למה הדבר דומה למלך שיצא ואפרכוס נכנס מלוין את המלך השבת להבדיל ואח״כ יוצאין לקראת אפרכוס לקראת יו״ט לקדשו ועל מלתיה דשמואל אמר לה בהדיא בברכות בירושלמי באלו דברים רבי חנינא אמר ינה״ק ואתי רבי חנינא כשמואל דא״ר חנינא בשם שמואל משל למלך יוצא ושלטון נכנס מלוין את המלך ואח״כ מכניסין את השלטון הלכך יין תחלה ואח״כ מאור ואח״כ הבדלה דכיון דהבדלה קודם לקידוש יעשה כל סדר הבדלה כדין מוצאי שבתות דעלמא ואח״כ יקדש ומה שאין נותנין האמוראין סימן לבשמים לפי שאין מברכין על הבשמים ביו״ט שהרי גם ביו״ט יש לנו נשמה יתירה כשבת.",




        "גָּמְרוּ, כּוֹס רִאשׁוֹן מְבָרֵךְ עָלָיו בִּרְכַּת הַמָּזוֹן, וְהַשֵּׁנִי אוֹמֵר עָלָיו קְדוּשַּׁת הַיּוֹם. אַמַּאי? וְנֵימְרִינְהוּ לְתַרְוַיְיהוּ אַחֲדָא כָּסָא! אֲמַר רַב הוּנָא אֲמַר רַב שֵׁשֶׁת: אֵין אוֹמְרִים שְׁתֵּי קְדוּשּׁוֹת עַל כּוֹס אֶחָד. מַאי טַעֲמָא? אֲמַר רַב נַחְמָן בַּר יִצְחָק: לְפִי שֶׁאֵין עוֹשִׂין מִצְוֹת חֲבִילוֹת חֲבִילוֹת. וְלָא? וְהָא תַּנְיָא: הַנִּכְנָס לְבֵיתוֹ בְּמוֹצָאֵי שַׁבָּת, מְבָרֵךְ עַל הַיַּיִן וְעַל הַמָּאוֹר וְעַל הַבְּשָׂמִים, וְאַחַר כָּךְ אוֹמֵר הַבְדָּלָה עַל הַכּוֹס. וְאִם אֵין לוֹ אֵלָּא כּוֹס אֶחָד, מַנִּיחוֹ לְאַחַר הַמָּזוֹן וּמְשַׁלְשְׁלָן כּוּלָּן לְאַחֲרָיו. ״אֵין לוֹ״ שָׁאנֵי. וְהָא יוֹם טוֹב שֶׁחָל לִהְיוֹת אַחַר הַשַּׁבָּת דְּאִית לֵיהּ, וַאֲמַר רַב ״יַיִן קִידּוּשׁ נֵר הַבְדָּלָה״! אָמְרִי: מִדְּלָא אֲמַר זְמַן, מִכְּלָל דְּבַשְּׁבִיעִי שֶׁל פֶּסַח עָסְקִינַן, דְּכָל מַאי דַּהֲוָה לֵיהּ אָכֵיל לֵיהּ, וְלֵית לֵיהּ. וְהָא יוֹם טוֹב רִאשׁוֹן דְּאִית לֵיהּ, וַאֲמַר אַבַּיֵי ״יַיִן קִידּוּשׁ זְמַן נֵר הַבְדָּלָה״, וְרָבָא אָמַר ״יַיִן קִידּוּשׁ נֵר הַבְדָּלָה זְמַן״! אֵלָּא הַבְדָּלָה וְקִידּוּשׁ חֲדָא מִילְּתָא הִיא, בִּרְכַּת הַמָּזוֹן וְקִידּוּשׁ תְּרֵי מִילֵּי נִינְהוּ. גּוּפָא: יוֹם טוֹב שֶׁחָל לִהְיוֹת אַחַר הַשַּׁבָּת, רַב אָמַר: יַיִן קִידּוּשׁ נֵר הַבְדָּלָה. וּשְׁמוּאֵל אָמַר: יַיִן נֵר הַבְדָּלָה קִידּוּשׁ.":null
    },

    "תוספות":{
         "ה״ג ראשון אומר עליו ברכת המזון – להפסיק והשני אומר עליו קידוש היום סמוך לסעודת שבת ולגירסא זו אתי שפיר הא דמשמע לעיל (ד׳ ק: ושם) דמפסיק לר׳ יהודה בעקירת שלחן קודם קידוש לפי שהיו רגילין לעקור שלחן לפני ברכת המזון אבל ספרים דגר׳ ראשון אומר עליו קידוש היום וטעמא שאינו יכול לטעום מכוס ברהמ״ז בלא קידוש קשה מנא ליה לעיל דמפסיקין לרבי יהודה בעקירת שלחן קודם קידוש. והא דקתני בתוספת׳ דברכות אורחין שהיו מסובין אצל בעל הבית וקדש עליהן היום עקרו עם חשיכה לבית המדרש חזרו ומזגו להם את הכוס אומר עליו קידוש דברי רבי יהודה וברכת המזון לא מזכיר כלל היינו משום דמתחלה עשו ברהמ״ז קודם יציאתם לעשות הפסק בין סעודת חול לסעודת שבת ולכך נמי עשו עקירה לבית המדרש. ונימרינהו לתרוייהו אחד כסא – לר׳ יוסי פריך כיון דתרוייהו אסעודת שבת קאתו כדפרישית לעיל (ד׳ ק.) דהך סעודה עולה לו לסעודת שבת הוה ליה למימר תרווייהו אחד כסא אבל לר׳ יהודה לא פריך כיון דברכת המזון אסעודת חול וקידוש על סעודה הבאה אין לומר שניהם על כוס אחד. שאין אומרי׳ שתי קדושות על כוס אחד – ויש נוהגין בחופה מטעם זה שלא לומר שבע ברכות על כוס ברכת המזון אלא מביאין כוס אחר ואין מברכין על השני בפה״ג כיון שכבר בירך על כוס ברכת המזון כי אין נכון לברך פעמים אך רבינו משולם היה אומר הכל על כוס אחד דלא דמי לברכת המזון וקידוש דתרי מילי נינהו כדאמרי׳ בסמוך אבל הכא חדא מלתא היא דברכת המזון גורם לברכת נישואין וברכת אירוסין ונישואין נהגו לומר על שתי כוסות וטעמא דרגילים זה בלא זה כדאמר בכתובות (ד׳ ז:) מברכין ברכת האירוסין בבית אירוסין וברכת חתנים בבית חתנים ועוד דנהגו לקרות כתובה בינתים והוי הפסק ולכך מתכוונים ולכך צריך ב׳ כוסות. מיתיבי הנכנס לביתו כו׳ – הוה מצי למיפרך ממתני׳ דאלו דברים (ברכות ד׳ נא:) דמייתי בסמוך ב״ש אומר נר ומזון ובשמים והבדלה כו׳ אלא פריך מברייתא משום דבעי לשנויי אין לו שאני כדקתני בברייתא אין לו אלא כוס אחד כו׳ ודרך הש״ס להקשות ממקום שמוצא לתרץ בפשיטות. מניחו לאחר המזון – הקשה ה״ר נסים איך יאכל קודם הבדלה הא אמרי׳ לקמן אסור לאדם שיטעום כלום קודם שיבדיל ואמימר נמי בת טוות כדאמר לקמן (ד׳ קז.) ותירץ דהכא מיירי כשאכל מבעו״י עד שחשיכה לו ואע״ג דמפסיקין להבדלה לשמואל וכ״ש לר׳ יהודה דמחמיר טפי והך ברייתא מוקי לה בסמוך כב״ש ואליבא דרבי יהודה הא דקאמר מניחו לאחר המזון לא שמותר לאכול אלא כלומר כשיפסיק סעודתו בברהמ״ז אז יבדיל וקשה דלשון הנכנס לביתו משמע שלא התחיל לאכול מבעו״י ועוד הקשה מורי ה״ר יחיאל דלקמן (ד׳ קה:) אמרי׳ על הך ברייתא ש״מ טעם מבדיל ולפירוש רבינו נסים דמיירי באכל מבעוד יום אין להוכיח כלום אלא י״ל דודאי בחנם אין לו לאכול קודם הבדלה אבל כשאין לו אלא כוס אחד מותר לאכול קודם הבדלה כדי לעשות על הכוס ברכת המזון. דאית ליה ואמר רב יקנ״ה – פי׳ בקונטר׳ דס״ד דביו״ט ראשון של פסח מיירי דאית ליה כוסות טובא כדתנן (לעיל ד׳ צט:) לא יפחתו לו מד׳ כוסות וקשה דהא כל ד׳ כוסות צריכי כל חד למילתיה ועוד דבסמוך דפריך מיקנה״ז לימא דבשמיני של חג מיירי דאיכא זמן ואכיל ושתה כל מה דהוה ליה ועוד דאכיל כל מה דהוה ליה לשון אכילה לא היה לו להזכיר אכוסות לכך נראה לפרש דביום טוב ראשון מסתמא אדם מכין הרבה ובשמיני של חג נמי שהוא רגל בפני עצמו רגילין להכין הרבה כדתנן (חולין ד׳ פג.) ד׳ פרקים בשנה צריך הטבח להודיע אמה מכרתי לשחוט וחשיב יו״ט האחרון של חג. רב אמר יקנ״ה – ומה שאין מזכיר בשמים פירש רשב״ם דטעם בשמים משום איבוד נשמה יתירה וביום טוב נמי איכא נשמה יתירה. וקשה דאם כן במוצאי יום טוב אמאי לא תקינו בשמים לכך נראה דביום טוב ליכא נשמה יתירה והכא אין מזכיר בשמים משום דשמחת יום טוב ואכילה ושתיה מועיל כמו בשמים ויש טעמים לא נכונים וזה הטעם נכון ועיקר. יקנ״ה – יין ברישא וא״ת אמאי לא תקינו נמי בברכת המזון יין ברישא כמו בכל מקום וליכא למימר דפטר ליה יין שבתוך הסעודה דכיון דאמר הב ונבריך איתסר למישתי ויש לומר דברכת המזון בא לשם גמר סעודה ומפסיק לכל מה שלפניו כדאמר לקמן (ד׳ קג:) דברכת המזון עקר דעתיה ממשתיא וצריך לברך אכסא דברכתא אף על גב דבירך אכסא קמא והשתא הכוס בידו ודעתו לשתות אח״כ אפילו הכי הוה הפסק לכך תיקנו לברך איין אחר ברכת המזון שאם יברך קודם יצטרך לברך שנית.":null
    },

    "ר׳ חננאל":{
        "גמרו כוס ראשון אומר עליו בהמ״ז והשני מקדש עליו ואמרינן ונמרינהו כלהו בחד כסא ודחי׳ לפי שאין אומרים שתי קדושות על כוס אחד מאי טעמא לפי שאין עושין מצות חבילות חבילות ולא והתניא הנכנס לבית במוצאי שבת מברך על היין ועל המאור ועל הבשמים ואחר כך אומר הבדלה ואם אין לו אלא כוס אחד מניחו לאחר המזון ומשלשלן כולן אחריו הנה אומר שתי קדושות על כוס אחד ושני׳ לית ליה שני והא יום טוב דאית ליה אחר שבת ואמר רב יקנ״ה ודחי׳ מדלא אמר רב זמן שמע מינה דהאי יום טוב אחר שבת דקתני רב יקנ״ה בשביעי של פסח עסקי׳ דלית ליה יין דכל דהוה ליה שתיה והא יום טוב [ראשון] דאית ליה ואמר אביי (יקנ״ה) [יקזנ״ה] ורבא אמר יקנה״ז ופריק כי קאמרי׳ שתי קדושות אבל קידושא ואבדלתא חדא קידושא היא כלומר וברכת המזון והקידוש של יום שתי קדושות הן ומאי שנא ופירוש קידוש היום והבדלה תרוייהו קודם אכילה הן קידוש וברכת המזון הקידוש קודם אכילה וברכת המזון אחר הסעודה לפיכך שתי קדושות הן ואסיקנא יום טוב שחל להיות אחר השבת הלכתא כרבא דאמר יקנה״ז.":null
    },

    "עין משפט נר מצוה פסחים ק״ב":{

        "רמב״ם":{
            
            "הלכות": "שבת",
            "פרק": "כ״ט",
            "הלכה": "י״ג"

            
        },

        "טור":{
            "חלק": "אורח חיים",
            "סימן": "רע״א",
            "סעיף": "ו׳"
        },

        "שולחן ערוך":{
            "חלק": "אורח חיים",
            "סימן": "רע״א",
            "סעיף": "ו׳"
        }

    },    
           
    "רי״ף": {
            "גופה יום טוב שחל להיות אחר שבת רב אמר יקנ״ה ושמואל אמר ינה״ק מאי האוי עלה אביי אמר יקזנ״ה רבא אמר יקנה״ז והילכתא כרבא ורב דאמר יקנ״ה ולא אמר יקנה״ז בשביעי של-פסח עסיקינן דליכא זמן  רב הונא בר יהודה איקלע  לבי רבא  רי״ף פסחים כ״א.  איתו לקמיה מאור ובשמים פתח רבא ובריך אבשמים ברישא והדר אמאור אמר ליה והא בין בית שמאי ובין בית הלל מאור ואחר כך בשמים דתנן בית שמאי אומ׳ נר ומזון בשמים והבדלה ובית הלל אומ׳ נר ובשמים מזון והבדלה עַנֵי רבא בתריה זו דברי ר׳ מאיר אבל ר׳ יהודה אומר לא נחלקו בית שמאי ובית הלל על המזון שבתחלה ועל הבדלה שהיא בסוף ועל מה נחלקו על המאור ועל הבשמים שבית שמאי אומ׳ מאור ואחר-כך בשמים ובית הלל אומ׳ בשמים ואחר-כך מאור ואמר ר׳ יוחנן  נהגו העם  כבית הלל ואליבא דר׳ יהודה.":null
    },

    "chidushim": {
        "rishonim": {

            "רי״ד": {
                "ר׳ יוסי אומר אוכלין והולכין עד שתחשך גמרו כוס ראשון אומר עליו ברכת המזון והשיני אומר עליו קידוש היום – פירוש: וכוס של קידוש צריך בורא פרי הגפן אף על פי שבירך בורא פרי הגפן על כוס של ברכת המזון ואף על פי שאם רצה לשתות אחר כוס של ברכה כמה כוסות הוא יכול לשתותן בלא ברכה אפילו הכי כוס של קידוש צריך בורא פרי הגפן מידי דהוה אארבעה כוסות של פסח דכיון דכל חדא וחדא היא מצוה באנפי נפשה מברך אכל חדא וחדא בורא פרי הגפן ולא מיפטרא חדא בברכה דאידך שאף על פי שיכול לשתות בין כוס ראשון לכוס שיני בלא ברכה כוס שיני בעי ברכה משום האי טעמא והם הכי נמי הכא כיון דכוס של קידוש הוי מצוה באנפי נפשיה אף על פי שבירך על כוס של ברכה צריך הוא לחזור ולברך על כוס של קידוש וכיון שצריך לברך על כוס של קידוש לפניו צריך הוא לברך נמי על כוס של ברכה לאחריו ואנן דלא עבדי׳ לא כר׳ יהודה ולא כר׳ יוסי אלא פורס מפה ומקדש אף על פי שאין אנו מפסיקין כר׳ יהודה אנו צריכים לברך על כוס של קידוש בורא פרי הגפן מפני שהיא מצוה בפני עצמה ועל הגפן על מה ששתה מבעוד יום קודם שיברך על כוס של קידוש.":null
            },

            "ריטב״א": {
                " גָּמְרוּ, כּוֹס רִאשׁוֹן מְבָרֵךְ עָלָיו בִּרְכַּת הַמָּזוֹן, וְהַשֵּׁנִי אוֹמֵר עָלָיו קְדוּשַּׁת הַיּוֹם. אַמַּאי? וְנֵימְרִינְהוּ לְתַרְוַיְיהוּ אַחֲדָא כָּסָא! אֲמַר רַב הוּנָא אֲמַר רַב שֵׁשֶׁת: אֵין אוֹמְרִים שְׁתֵּי קְדוּשּׁוֹת עַל כּוֹס אֶחָד. מַאי טַעֲמָא? אֲמַר רַב נַחְמָן בַּר יִצְחָק: לְפִי שֶׁאֵין עוֹשִׂין מִצְוֹת חֲבִילוֹת חֲבִילוֹת. וְלָא? וְהָא תַּנְיָא: הַנִּכְנָס לְבֵיתוֹ בְּמוֹצָאֵי שַׁבָּת, מְבָרֵךְ עַל הַיַּיִן וְעַל הַמָּאוֹר וְעַל הַבְּשָׂמִים, וְאַחַר כָּךְ אוֹמֵר הַבְדָּלָה עַל הַכּוֹס. וְאִם אֵין לוֹ אֵלָּא כּוֹס אֶחָד, מַנִּיחוֹ לְאַחַר הַמָּזוֹן וּמְשַׁלְשְׁלָן כּוּלָּן לְאַחֲרָיו. ״אֵין לוֹ״ שָׁאנֵי. וְהָא יוֹם טוֹב שֶׁחָל לִהְיוֹת אַחַר הַשַּׁבָּת דְּאִית לֵיהּ, וַאֲמַר רַב ״יַיִן קִידּוּשׁ נֵר הַבְדָּלָה״! אָמְרִי: מִדְּלָא אֲמַר זְמַן, מִכְּלָל דְּבַשְּׁבִיעִי שֶׁל פֶּסַח עָסְקִינַן, דְּכָל מַאי דַּהֲוָה לֵיהּ אָכֵיל לֵיהּ, וְלֵית לֵיהּ. וְהָא יוֹם טוֹב רִאשׁוֹן דְּאִית לֵיהּ, וַאֲמַר אַבַּיֵי ״יַיִן קִידּוּשׁ זְמַן נֵר הַבְדָּלָה״, וְרָבָא אָמַר ״יַיִן קִידּוּשׁ נֵר הַבְדָּלָה זְמַן״! אֵלָּא הַבְדָּלָה וְקִידּוּשׁ חֲדָא מִילְּתָא הִיא, בִּרְכַּת הַמָּזוֹן וְקִידּוּשׁ תְּרֵי מִילֵּי נִינְהוּ. גּוּפָא: יוֹם טוֹב שֶׁחָל לִהְיוֹת אַחַר הַשַּׁבָּת, רַב אָמַר: יַיִן קִידּוּשׁ נֵר הַבְדָּלָה. וּשְׁמוּאֵל אָמַר: יַיִן נֵר הַבְדָּלָה קִידּוּשׁ.":null
            },

            "<another rishon>": {
                "<nothing yet>":null
            }

        },

        "acharonim": {
            "<some acharon>": "<nothing yet>",
            "<another acharon>": "<nothing yet>"
        }
    }
}